# GetIndexStreamTriangle Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IndexBuffer..::..GetIndexStreamTriangle Method
IndexBuffer Class See Also
---
Gets a stream that can be used to write IndexTriangle primitives into the buffer.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public IndexStreamTriangle GetIndexStreamTriangle()
```

Visual Basic
---
```text
Public Function GetIndexStreamTriangle As IndexStreamTriangle
```

Visual C++
---
```text
public:
IndexStreamTriangle^ GetIndexStreamTriangle()
```

# ### Return Value
The stream that can be used to write into this buffer.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown if the buffer is not mapped. -or- Thrown if the buffer has insufficient space. |

# See Also
IndexBuffer Class
Autodesk.Revit.DB.DirectContext3D Namespace